app/views/pizzas/_form.html.erb

    <%= f.label :tipo %><br />
    <%= f.select :tipo, PizzaTipo.all(:order=>:nome).collect{|p| [p.nome, p.id]} %>
---
SELECT `pizza_tipos`.* FROM `pizza_tipos` ORDER BY nome