app/controllers/comentarios_controller.rb

  def index
    @comentarios = Comentario.search params
---
SELECT `comentarios`.* FROM `comentarios`

  def show
    @comentario = Comentario.find(params[:id])
---
SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 1 LIMIT 1

  def edit
    @comentario = Comentario.find(params[:id])
---
SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 2 LIMIT 1

  def create
    @comentario = Comentario.new(params[:comentario])

    respond_to do |format|
      if @comentario.save
---
INSERT INTO `comentarios` (`assunto`, `autor`, `comentario`, `created_at`, `updated_at`) VALUES (NULL, NULL, NULL, '2013-11-25 19:26:01', '2013-11-25 19:26:01')

  def update
    @comentario = Comentario.find(params[:id])

    respond_to do |format|
      if @comentario.update_attributes(params[:comentario])
---
SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 2 LIMIT 1
UPDATE `comentarios` SET `comentario` = 'É ruim.', `updated_at` = '2013-11-26 13:16:25' WHERE `comentarios`.`id` = 2

  def destroy
    @comentario = Comentario.find(params[:id])
    @comentario.destroy
---
SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 1 LIMIT 1
DELETE FROM `comentarios` WHERE `comentarios`.`id` = 1