app/controllers/pizza_tipos_controller.rb

SELECT `pizza_tipos`.* FROM `pizza_tipos`
---
  def index
    @pizza_tipos = PizzaTipo.all

SELECT `pizza_tipos`.* FROM `pizza_tipos` WHERE `pizza_tipos`.`id` = 1 LIMIT 1
---
  def show
    @pizza_tipo = PizzaTipo.find(params[:id])

INSERT INTO `pizza_tipos` (`created_at`, `nome`, `updated_at`) VALUES ('2012-11-16 17:37:51', 'Doce', '2012-11-16 17:37:51')
---
  def create
    @pizza_tipo = PizzaTipo.new(params[:pizza_tipo])

    respond_to do |format|
      if @pizza_tipo.save